L-Tek/FF-LPC546XX/CMISIS-PACK/REPO/L-Tek.FF_LPC546XX_BSP.1.0.0/demo_apps/led_blinky/led_blinky.c
/*
 * The Clear BSD License
 * Copyright 2017 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 * that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_gpio.h"

#include "pin_mux.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/


/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/
volatile uint32_t g_systickCounter;

/*******************************************************************************
 * Code
 ******************************************************************************/
void SysTick_Handler(void)
{
    if (g_systickCounter != 0U)
    { 
        g_systickCounter--;
    }
}

void SysTick_DelayTicks(uint32_t n)
{
    g_systickCounter = n;
    while(g_systickCounter != 0U)
    {
    }
}

/*!
 * @brief Main function
 */
int main(void)
{
    /* Define the init structure for the output LED pin*/
    gpio_pin_config_t led_config = {
        kGPIO_DigitalOutput, 0,
    };

    /* Board pin init */
    BOARD_InitPins();

    /* Init output LED GPIO. */
    GPIO_PortInit(GPIO, BOARD_INITPINS_LED1_PORT);
    GPIO_PinInit(GPIO, BOARD_INITPINS_LED1_PORT, BOARD_INITPINS_LED1_PIN, &led_config);

    GPIO_PortInit(GPIO, BOARD_INITPINS_LED2_PORT);
    GPIO_PinInit(GPIO, BOARD_INITPINS_LED2_PORT, BOARD_INITPINS_LED2_PIN, &led_config);
	
    GPIO_PortInit(GPIO, BOARD_INITPINS_LED3_PORT);
    GPIO_PinInit(GPIO, BOARD_INITPINS_LED3_PORT, BOARD_INITPINS_LED3_PIN, &led_config);

    GPIO_PortInit(GPIO, BOARD_INITPINS_LED4_PORT);
    GPIO_PinInit(GPIO, BOARD_INITPINS_LED4_PORT, BOARD_INITPINS_LED4_PIN, &led_config);

    /* Set systick reload value to generate 1ms interrupt */
    if(SysTick_Config(SystemCoreClock / 1000U))
    {
        while(1)
        {
        }
    }
    
    while (1)
    {
        /* Delay 1000 ms */
        SysTick_DelayTicks(200U);
		
        GPIO_PortToggle(GPIO, BOARD_INITPINS_LED1_PORT, 1u << BOARD_INITPINS_LED1_PIN);
        GPIO_PortToggle(GPIO, BOARD_INITPINS_LED2_PORT, 1u << BOARD_INITPINS_LED2_PIN);
        GPIO_PortToggle(GPIO, BOARD_INITPINS_LED3_PORT, 1u << BOARD_INITPINS_LED3_PIN);
        GPIO_PortToggle(GPIO, BOARD_INITPINS_LED4_PORT, 1u << BOARD_INITPINS_LED4_PIN);
    }
}
